{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.21.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "384000"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1_1/flatten_1_1/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384000"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_6_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_6_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_7_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_7_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inputs", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "384000"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/flatten_1_1/Reshape", "op": "Reshape", "input": ["inputs", "StatefulPartitionedCall/sequential_1_1/flatten_1_1/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/flatten_1_1/Reshape", "StatefulPartitionedCall/sequential_1_1/dense_4_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_4_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_4_1/Relu", "StatefulPartitionedCall/sequential_1_1/dense_5_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_5_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_6_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_5_1/Relu", "StatefulPartitionedCall/sequential_1_1/dense_6_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_6_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_7_1/Sigmoid", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_6_1/Relu", "StatefulPartitionedCall/sequential_1_1/dense_7_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_7_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "U2lnbW9pZA=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1_1/dense_7_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1882}}, "weightsManifest": [{"paths": ["group1-shard1of47.bin", "group1-shard2of47.bin", "group1-shard3of47.bin", "group1-shard4of47.bin", "group1-shard5of47.bin", "group1-shard6of47.bin", "group1-shard7of47.bin", "group1-shard8of47.bin", "group1-shard9of47.bin", "group1-shard10of47.bin", "group1-shard11of47.bin", "group1-shard12of47.bin", "group1-shard13of47.bin", "group1-shard14of47.bin", "group1-shard15of47.bin", "group1-shard16of47.bin", "group1-shard17of47.bin", "group1-shard18of47.bin", "group1-shard19of47.bin", "group1-shard20of47.bin", "group1-shard21of47.bin", "group1-shard22of47.bin", "group1-shard23of47.bin", "group1-shard24of47.bin", "group1-shard25of47.bin", "group1-shard26of47.bin", "group1-shard27of47.bin", "group1-shard28of47.bin", "group1-shard29of47.bin", "group1-shard30of47.bin", "group1-shard31of47.bin", "group1-shard32of47.bin", "group1-shard33of47.bin", "group1-shard34of47.bin", "group1-shard35of47.bin", "group1-shard36of47.bin", "group1-shard37of47.bin", "group1-shard38of47.bin", "group1-shard39of47.bin", "group1-shard40of47.bin", "group1-shard41of47.bin", "group1-shard42of47.bin", "group1-shard43of47.bin", "group1-shard44of47.bin", "group1-shard45of47.bin", "group1-shard46of47.bin", "group1-shard47of47.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1_1/flatten_1_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Cast/ReadVariableOp", "shape": [384000, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Add/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/Cast/ReadVariableOp", "shape": [128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/Add/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_6_1/Cast/ReadVariableOp", "shape": [64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_6_1/Add/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_7_1/Cast/ReadVariableOp", "shape": [32, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_7_1/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}