{"format": "layers-model", "generatedBy": "keras v3.4.1", "convertedBy": "TensorFlow.js Converter v4.21.0", "modelTopology": {"keras_version": "3.4.1", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 384000, 1], "dtype": "float32", "sparse": false, "name": "input_layer"}}, {"class_name": "Conv1D", "config": {"name": "conv1d", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [2], "padding": "valid", "strides": [2], "data_format": "channels_last"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [2], "padding": "valid", "strides": [2], "data_format": "channels_last"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 128, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [2], "padding": "valid", "strides": [2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": [null, 384000, 1]}}, "training_config": {"loss": "binary_crossentropy", "loss_weights": null, "metrics": ["accuracy", {"class_name": "AUC", "config": {"name": "auc", "dtype": "float32", "num_thresholds": 200, "curve": "ROC", "summation_method": "interpolation", "multi_label": false, "num_labels": null, "label_weights": null, "from_logits": false}}, {"class_name": "Recall", "config": {"name": "recall", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}, {"class_name": "Precision", "config": {"name": "precision", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": true, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 9.999999747378752e-05, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of751.bin", "group1-shard2of751.bin", "group1-shard3of751.bin", "group1-shard4of751.bin", "group1-shard5of751.bin", "group1-shard6of751.bin", "group1-shard7of751.bin", "group1-shard8of751.bin", "group1-shard9of751.bin", "group1-shard10of751.bin", "group1-shard11of751.bin", "group1-shard12of751.bin", "group1-shard13of751.bin", "group1-shard14of751.bin", "group1-shard15of751.bin", "group1-shard16of751.bin", "group1-shard17of751.bin", "group1-shard18of751.bin", "group1-shard19of751.bin", "group1-shard20of751.bin", "group1-shard21of751.bin", "group1-shard22of751.bin", "group1-shard23of751.bin", "group1-shard24of751.bin", "group1-shard25of751.bin", "group1-shard26of751.bin", "group1-shard27of751.bin", "group1-shard28of751.bin", "group1-shard29of751.bin", "group1-shard30of751.bin", "group1-shard31of751.bin", "group1-shard32of751.bin", "group1-shard33of751.bin", "group1-shard34of751.bin", "group1-shard35of751.bin", "group1-shard36of751.bin", "group1-shard37of751.bin", "group1-shard38of751.bin", "group1-shard39of751.bin", "group1-shard40of751.bin", "group1-shard41of751.bin", "group1-shard42of751.bin", "group1-shard43of751.bin", "group1-shard44of751.bin", "group1-shard45of751.bin", "group1-shard46of751.bin", "group1-shard47of751.bin", "group1-shard48of751.bin", "group1-shard49of751.bin", "group1-shard50of751.bin", "group1-shard51of751.bin", "group1-shard52of751.bin", "group1-shard53of751.bin", "group1-shard54of751.bin", "group1-shard55of751.bin", "group1-shard56of751.bin", "group1-shard57of751.bin", "group1-shard58of751.bin", "group1-shard59of751.bin", "group1-shard60of751.bin", "group1-shard61of751.bin", "group1-shard62of751.bin", "group1-shard63of751.bin", "group1-shard64of751.bin", "group1-shard65of751.bin", "group1-shard66of751.bin", "group1-shard67of751.bin", "group1-shard68of751.bin", "group1-shard69of751.bin", "group1-shard70of751.bin", "group1-shard71of751.bin", "group1-shard72of751.bin", "group1-shard73of751.bin", "group1-shard74of751.bin", "group1-shard75of751.bin", "group1-shard76of751.bin", "group1-shard77of751.bin", "group1-shard78of751.bin", "group1-shard79of751.bin", "group1-shard80of751.bin", "group1-shard81of751.bin", "group1-shard82of751.bin", "group1-shard83of751.bin", "group1-shard84of751.bin", "group1-shard85of751.bin", "group1-shard86of751.bin", "group1-shard87of751.bin", "group1-shard88of751.bin", "group1-shard89of751.bin", "group1-shard90of751.bin", "group1-shard91of751.bin", "group1-shard92of751.bin", "group1-shard93of751.bin", "group1-shard94of751.bin", "group1-shard95of751.bin", "group1-shard96of751.bin", "group1-shard97of751.bin", "group1-shard98of751.bin", "group1-shard99of751.bin", "group1-shard100of751.bin", "group1-shard101of751.bin", "group1-shard102of751.bin", "group1-shard103of751.bin", "group1-shard104of751.bin", "group1-shard105of751.bin", "group1-shard106of751.bin", "group1-shard107of751.bin", "group1-shard108of751.bin", "group1-shard109of751.bin", "group1-shard110of751.bin", "group1-shard111of751.bin", "group1-shard112of751.bin", "group1-shard113of751.bin", "group1-shard114of751.bin", "group1-shard115of751.bin", "group1-shard116of751.bin", "group1-shard117of751.bin", "group1-shard118of751.bin", "group1-shard119of751.bin", "group1-shard120of751.bin", "group1-shard121of751.bin", "group1-shard122of751.bin", "group1-shard123of751.bin", "group1-shard124of751.bin", "group1-shard125of751.bin", "group1-shard126of751.bin", "group1-shard127of751.bin", "group1-shard128of751.bin", "group1-shard129of751.bin", "group1-shard130of751.bin", "group1-shard131of751.bin", "group1-shard132of751.bin", "group1-shard133of751.bin", "group1-shard134of751.bin", "group1-shard135of751.bin", "group1-shard136of751.bin", "group1-shard137of751.bin", "group1-shard138of751.bin", "group1-shard139of751.bin", "group1-shard140of751.bin", "group1-shard141of751.bin", "group1-shard142of751.bin", "group1-shard143of751.bin", "group1-shard144of751.bin", "group1-shard145of751.bin", "group1-shard146of751.bin", "group1-shard147of751.bin", "group1-shard148of751.bin", "group1-shard149of751.bin", "group1-shard150of751.bin", "group1-shard151of751.bin", "group1-shard152of751.bin", "group1-shard153of751.bin", "group1-shard154of751.bin", "group1-shard155of751.bin", "group1-shard156of751.bin", "group1-shard157of751.bin", "group1-shard158of751.bin", "group1-shard159of751.bin", "group1-shard160of751.bin", "group1-shard161of751.bin", "group1-shard162of751.bin", "group1-shard163of751.bin", "group1-shard164of751.bin", "group1-shard165of751.bin", "group1-shard166of751.bin", "group1-shard167of751.bin", "group1-shard168of751.bin", "group1-shard169of751.bin", "group1-shard170of751.bin", "group1-shard171of751.bin", "group1-shard172of751.bin", "group1-shard173of751.bin", "group1-shard174of751.bin", "group1-shard175of751.bin", "group1-shard176of751.bin", "group1-shard177of751.bin", "group1-shard178of751.bin", "group1-shard179of751.bin", "group1-shard180of751.bin", "group1-shard181of751.bin", "group1-shard182of751.bin", "group1-shard183of751.bin", "group1-shard184of751.bin", "group1-shard185of751.bin", "group1-shard186of751.bin", "group1-shard187of751.bin", "group1-shard188of751.bin", "group1-shard189of751.bin", "group1-shard190of751.bin", "group1-shard191of751.bin", "group1-shard192of751.bin", "group1-shard193of751.bin", "group1-shard194of751.bin", "group1-shard195of751.bin", "group1-shard196of751.bin", "group1-shard197of751.bin", "group1-shard198of751.bin", "group1-shard199of751.bin", "group1-shard200of751.bin", "group1-shard201of751.bin", "group1-shard202of751.bin", "group1-shard203of751.bin", "group1-shard204of751.bin", "group1-shard205of751.bin", "group1-shard206of751.bin", "group1-shard207of751.bin", "group1-shard208of751.bin", "group1-shard209of751.bin", "group1-shard210of751.bin", "group1-shard211of751.bin", "group1-shard212of751.bin", "group1-shard213of751.bin", "group1-shard214of751.bin", "group1-shard215of751.bin", "group1-shard216of751.bin", "group1-shard217of751.bin", "group1-shard218of751.bin", "group1-shard219of751.bin", "group1-shard220of751.bin", "group1-shard221of751.bin", "group1-shard222of751.bin", "group1-shard223of751.bin", "group1-shard224of751.bin", "group1-shard225of751.bin", "group1-shard226of751.bin", "group1-shard227of751.bin", "group1-shard228of751.bin", "group1-shard229of751.bin", "group1-shard230of751.bin", "group1-shard231of751.bin", "group1-shard232of751.bin", "group1-shard233of751.bin", "group1-shard234of751.bin", "group1-shard235of751.bin", "group1-shard236of751.bin", "group1-shard237of751.bin", "group1-shard238of751.bin", "group1-shard239of751.bin", "group1-shard240of751.bin", "group1-shard241of751.bin", "group1-shard242of751.bin", "group1-shard243of751.bin", "group1-shard244of751.bin", "group1-shard245of751.bin", "group1-shard246of751.bin", "group1-shard247of751.bin", "group1-shard248of751.bin", "group1-shard249of751.bin", "group1-shard250of751.bin", "group1-shard251of751.bin", "group1-shard252of751.bin", "group1-shard253of751.bin", "group1-shard254of751.bin", "group1-shard255of751.bin", "group1-shard256of751.bin", "group1-shard257of751.bin", "group1-shard258of751.bin", "group1-shard259of751.bin", "group1-shard260of751.bin", "group1-shard261of751.bin", "group1-shard262of751.bin", "group1-shard263of751.bin", "group1-shard264of751.bin", "group1-shard265of751.bin", "group1-shard266of751.bin", "group1-shard267of751.bin", "group1-shard268of751.bin", "group1-shard269of751.bin", "group1-shard270of751.bin", "group1-shard271of751.bin", "group1-shard272of751.bin", "group1-shard273of751.bin", "group1-shard274of751.bin", "group1-shard275of751.bin", "group1-shard276of751.bin", "group1-shard277of751.bin", "group1-shard278of751.bin", "group1-shard279of751.bin", "group1-shard280of751.bin", "group1-shard281of751.bin", "group1-shard282of751.bin", "group1-shard283of751.bin", "group1-shard284of751.bin", "group1-shard285of751.bin", "group1-shard286of751.bin", "group1-shard287of751.bin", "group1-shard288of751.bin", "group1-shard289of751.bin", "group1-shard290of751.bin", "group1-shard291of751.bin", "group1-shard292of751.bin", "group1-shard293of751.bin", "group1-shard294of751.bin", "group1-shard295of751.bin", "group1-shard296of751.bin", "group1-shard297of751.bin", "group1-shard298of751.bin", "group1-shard299of751.bin", "group1-shard300of751.bin", "group1-shard301of751.bin", "group1-shard302of751.bin", "group1-shard303of751.bin", "group1-shard304of751.bin", "group1-shard305of751.bin", "group1-shard306of751.bin", "group1-shard307of751.bin", "group1-shard308of751.bin", "group1-shard309of751.bin", "group1-shard310of751.bin", "group1-shard311of751.bin", "group1-shard312of751.bin", "group1-shard313of751.bin", "group1-shard314of751.bin", "group1-shard315of751.bin", "group1-shard316of751.bin", "group1-shard317of751.bin", "group1-shard318of751.bin", "group1-shard319of751.bin", "group1-shard320of751.bin", "group1-shard321of751.bin", "group1-shard322of751.bin", "group1-shard323of751.bin", "group1-shard324of751.bin", "group1-shard325of751.bin", "group1-shard326of751.bin", "group1-shard327of751.bin", "group1-shard328of751.bin", "group1-shard329of751.bin", "group1-shard330of751.bin", "group1-shard331of751.bin", "group1-shard332of751.bin", "group1-shard333of751.bin", "group1-shard334of751.bin", "group1-shard335of751.bin", "group1-shard336of751.bin", "group1-shard337of751.bin", "group1-shard338of751.bin", "group1-shard339of751.bin", "group1-shard340of751.bin", "group1-shard341of751.bin", "group1-shard342of751.bin", "group1-shard343of751.bin", "group1-shard344of751.bin", "group1-shard345of751.bin", "group1-shard346of751.bin", "group1-shard347of751.bin", "group1-shard348of751.bin", "group1-shard349of751.bin", "group1-shard350of751.bin", "group1-shard351of751.bin", "group1-shard352of751.bin", "group1-shard353of751.bin", "group1-shard354of751.bin", "group1-shard355of751.bin", "group1-shard356of751.bin", "group1-shard357of751.bin", "group1-shard358of751.bin", "group1-shard359of751.bin", "group1-shard360of751.bin", "group1-shard361of751.bin", "group1-shard362of751.bin", "group1-shard363of751.bin", "group1-shard364of751.bin", "group1-shard365of751.bin", "group1-shard366of751.bin", "group1-shard367of751.bin", "group1-shard368of751.bin", "group1-shard369of751.bin", "group1-shard370of751.bin", "group1-shard371of751.bin", "group1-shard372of751.bin", "group1-shard373of751.bin", "group1-shard374of751.bin", "group1-shard375of751.bin", "group1-shard376of751.bin", "group1-shard377of751.bin", "group1-shard378of751.bin", "group1-shard379of751.bin", "group1-shard380of751.bin", "group1-shard381of751.bin", "group1-shard382of751.bin", "group1-shard383of751.bin", "group1-shard384of751.bin", "group1-shard385of751.bin", "group1-shard386of751.bin", "group1-shard387of751.bin", "group1-shard388of751.bin", "group1-shard389of751.bin", "group1-shard390of751.bin", "group1-shard391of751.bin", "group1-shard392of751.bin", "group1-shard393of751.bin", "group1-shard394of751.bin", "group1-shard395of751.bin", "group1-shard396of751.bin", "group1-shard397of751.bin", "group1-shard398of751.bin", "group1-shard399of751.bin", "group1-shard400of751.bin", "group1-shard401of751.bin", "group1-shard402of751.bin", "group1-shard403of751.bin", "group1-shard404of751.bin", "group1-shard405of751.bin", "group1-shard406of751.bin", "group1-shard407of751.bin", "group1-shard408of751.bin", "group1-shard409of751.bin", "group1-shard410of751.bin", "group1-shard411of751.bin", "group1-shard412of751.bin", "group1-shard413of751.bin", "group1-shard414of751.bin", "group1-shard415of751.bin", "group1-shard416of751.bin", "group1-shard417of751.bin", "group1-shard418of751.bin", "group1-shard419of751.bin", "group1-shard420of751.bin", "group1-shard421of751.bin", "group1-shard422of751.bin", "group1-shard423of751.bin", "group1-shard424of751.bin", "group1-shard425of751.bin", "group1-shard426of751.bin", "group1-shard427of751.bin", "group1-shard428of751.bin", "group1-shard429of751.bin", "group1-shard430of751.bin", "group1-shard431of751.bin", "group1-shard432of751.bin", "group1-shard433of751.bin", "group1-shard434of751.bin", "group1-shard435of751.bin", "group1-shard436of751.bin", "group1-shard437of751.bin", "group1-shard438of751.bin", "group1-shard439of751.bin", "group1-shard440of751.bin", "group1-shard441of751.bin", "group1-shard442of751.bin", "group1-shard443of751.bin", "group1-shard444of751.bin", "group1-shard445of751.bin", "group1-shard446of751.bin", "group1-shard447of751.bin", "group1-shard448of751.bin", "group1-shard449of751.bin", "group1-shard450of751.bin", "group1-shard451of751.bin", "group1-shard452of751.bin", "group1-shard453of751.bin", "group1-shard454of751.bin", "group1-shard455of751.bin", "group1-shard456of751.bin", "group1-shard457of751.bin", "group1-shard458of751.bin", "group1-shard459of751.bin", "group1-shard460of751.bin", "group1-shard461of751.bin", "group1-shard462of751.bin", "group1-shard463of751.bin", "group1-shard464of751.bin", "group1-shard465of751.bin", "group1-shard466of751.bin", "group1-shard467of751.bin", "group1-shard468of751.bin", "group1-shard469of751.bin", "group1-shard470of751.bin", "group1-shard471of751.bin", "group1-shard472of751.bin", "group1-shard473of751.bin", "group1-shard474of751.bin", "group1-shard475of751.bin", "group1-shard476of751.bin", "group1-shard477of751.bin", "group1-shard478of751.bin", "group1-shard479of751.bin", "group1-shard480of751.bin", "group1-shard481of751.bin", "group1-shard482of751.bin", "group1-shard483of751.bin", "group1-shard484of751.bin", "group1-shard485of751.bin", "group1-shard486of751.bin", "group1-shard487of751.bin", "group1-shard488of751.bin", "group1-shard489of751.bin", "group1-shard490of751.bin", "group1-shard491of751.bin", "group1-shard492of751.bin", "group1-shard493of751.bin", "group1-shard494of751.bin", "group1-shard495of751.bin", "group1-shard496of751.bin", "group1-shard497of751.bin", "group1-shard498of751.bin", "group1-shard499of751.bin", "group1-shard500of751.bin", "group1-shard501of751.bin", "group1-shard502of751.bin", "group1-shard503of751.bin", "group1-shard504of751.bin", "group1-shard505of751.bin", "group1-shard506of751.bin", "group1-shard507of751.bin", "group1-shard508of751.bin", "group1-shard509of751.bin", "group1-shard510of751.bin", "group1-shard511of751.bin", "group1-shard512of751.bin", "group1-shard513of751.bin", "group1-shard514of751.bin", "group1-shard515of751.bin", "group1-shard516of751.bin", "group1-shard517of751.bin", "group1-shard518of751.bin", "group1-shard519of751.bin", "group1-shard520of751.bin", "group1-shard521of751.bin", "group1-shard522of751.bin", "group1-shard523of751.bin", "group1-shard524of751.bin", "group1-shard525of751.bin", "group1-shard526of751.bin", "group1-shard527of751.bin", "group1-shard528of751.bin", "group1-shard529of751.bin", "group1-shard530of751.bin", "group1-shard531of751.bin", "group1-shard532of751.bin", "group1-shard533of751.bin", "group1-shard534of751.bin", "group1-shard535of751.bin", "group1-shard536of751.bin", "group1-shard537of751.bin", "group1-shard538of751.bin", "group1-shard539of751.bin", "group1-shard540of751.bin", "group1-shard541of751.bin", "group1-shard542of751.bin", "group1-shard543of751.bin", "group1-shard544of751.bin", "group1-shard545of751.bin", "group1-shard546of751.bin", "group1-shard547of751.bin", "group1-shard548of751.bin", "group1-shard549of751.bin", "group1-shard550of751.bin", "group1-shard551of751.bin", "group1-shard552of751.bin", "group1-shard553of751.bin", "group1-shard554of751.bin", "group1-shard555of751.bin", "group1-shard556of751.bin", "group1-shard557of751.bin", "group1-shard558of751.bin", "group1-shard559of751.bin", "group1-shard560of751.bin", "group1-shard561of751.bin", "group1-shard562of751.bin", "group1-shard563of751.bin", "group1-shard564of751.bin", "group1-shard565of751.bin", "group1-shard566of751.bin", "group1-shard567of751.bin", "group1-shard568of751.bin", "group1-shard569of751.bin", "group1-shard570of751.bin", "group1-shard571of751.bin", "group1-shard572of751.bin", "group1-shard573of751.bin", "group1-shard574of751.bin", "group1-shard575of751.bin", "group1-shard576of751.bin", "group1-shard577of751.bin", "group1-shard578of751.bin", "group1-shard579of751.bin", "group1-shard580of751.bin", "group1-shard581of751.bin", "group1-shard582of751.bin", "group1-shard583of751.bin", "group1-shard584of751.bin", "group1-shard585of751.bin", "group1-shard586of751.bin", "group1-shard587of751.bin", "group1-shard588of751.bin", "group1-shard589of751.bin", "group1-shard590of751.bin", "group1-shard591of751.bin", "group1-shard592of751.bin", "group1-shard593of751.bin", "group1-shard594of751.bin", "group1-shard595of751.bin", "group1-shard596of751.bin", "group1-shard597of751.bin", "group1-shard598of751.bin", "group1-shard599of751.bin", "group1-shard600of751.bin", "group1-shard601of751.bin", "group1-shard602of751.bin", "group1-shard603of751.bin", "group1-shard604of751.bin", "group1-shard605of751.bin", "group1-shard606of751.bin", "group1-shard607of751.bin", "group1-shard608of751.bin", "group1-shard609of751.bin", "group1-shard610of751.bin", "group1-shard611of751.bin", "group1-shard612of751.bin", "group1-shard613of751.bin", "group1-shard614of751.bin", "group1-shard615of751.bin", "group1-shard616of751.bin", "group1-shard617of751.bin", "group1-shard618of751.bin", "group1-shard619of751.bin", "group1-shard620of751.bin", "group1-shard621of751.bin", "group1-shard622of751.bin", "group1-shard623of751.bin", "group1-shard624of751.bin", "group1-shard625of751.bin", "group1-shard626of751.bin", "group1-shard627of751.bin", "group1-shard628of751.bin", "group1-shard629of751.bin", "group1-shard630of751.bin", "group1-shard631of751.bin", "group1-shard632of751.bin", "group1-shard633of751.bin", "group1-shard634of751.bin", "group1-shard635of751.bin", "group1-shard636of751.bin", "group1-shard637of751.bin", "group1-shard638of751.bin", "group1-shard639of751.bin", "group1-shard640of751.bin", "group1-shard641of751.bin", "group1-shard642of751.bin", "group1-shard643of751.bin", "group1-shard644of751.bin", "group1-shard645of751.bin", "group1-shard646of751.bin", "group1-shard647of751.bin", "group1-shard648of751.bin", "group1-shard649of751.bin", "group1-shard650of751.bin", "group1-shard651of751.bin", "group1-shard652of751.bin", "group1-shard653of751.bin", "group1-shard654of751.bin", "group1-shard655of751.bin", "group1-shard656of751.bin", "group1-shard657of751.bin", "group1-shard658of751.bin", "group1-shard659of751.bin", "group1-shard660of751.bin", "group1-shard661of751.bin", "group1-shard662of751.bin", "group1-shard663of751.bin", "group1-shard664of751.bin", "group1-shard665of751.bin", "group1-shard666of751.bin", "group1-shard667of751.bin", "group1-shard668of751.bin", "group1-shard669of751.bin", "group1-shard670of751.bin", "group1-shard671of751.bin", "group1-shard672of751.bin", "group1-shard673of751.bin", "group1-shard674of751.bin", "group1-shard675of751.bin", "group1-shard676of751.bin", "group1-shard677of751.bin", "group1-shard678of751.bin", "group1-shard679of751.bin", "group1-shard680of751.bin", "group1-shard681of751.bin", "group1-shard682of751.bin", "group1-shard683of751.bin", "group1-shard684of751.bin", "group1-shard685of751.bin", "group1-shard686of751.bin", "group1-shard687of751.bin", "group1-shard688of751.bin", "group1-shard689of751.bin", "group1-shard690of751.bin", "group1-shard691of751.bin", "group1-shard692of751.bin", "group1-shard693of751.bin", "group1-shard694of751.bin", "group1-shard695of751.bin", "group1-shard696of751.bin", "group1-shard697of751.bin", "group1-shard698of751.bin", "group1-shard699of751.bin", "group1-shard700of751.bin", "group1-shard701of751.bin", "group1-shard702of751.bin", "group1-shard703of751.bin", "group1-shard704of751.bin", "group1-shard705of751.bin", "group1-shard706of751.bin", "group1-shard707of751.bin", "group1-shard708of751.bin", "group1-shard709of751.bin", "group1-shard710of751.bin", "group1-shard711of751.bin", "group1-shard712of751.bin", "group1-shard713of751.bin", "group1-shard714of751.bin", "group1-shard715of751.bin", "group1-shard716of751.bin", "group1-shard717of751.bin", "group1-shard718of751.bin", "group1-shard719of751.bin", "group1-shard720of751.bin", "group1-shard721of751.bin", "group1-shard722of751.bin", "group1-shard723of751.bin", "group1-shard724of751.bin", "group1-shard725of751.bin", "group1-shard726of751.bin", "group1-shard727of751.bin", "group1-shard728of751.bin", "group1-shard729of751.bin", "group1-shard730of751.bin", "group1-shard731of751.bin", "group1-shard732of751.bin", "group1-shard733of751.bin", "group1-shard734of751.bin", "group1-shard735of751.bin", "group1-shard736of751.bin", "group1-shard737of751.bin", "group1-shard738of751.bin", "group1-shard739of751.bin", "group1-shard740of751.bin", "group1-shard741of751.bin", "group1-shard742of751.bin", "group1-shard743of751.bin", "group1-shard744of751.bin", "group1-shard745of751.bin", "group1-shard746of751.bin", "group1-shard747of751.bin", "group1-shard748of751.bin", "group1-shard749of751.bin", "group1-shard750of751.bin", "group1-shard751of751.bin"], "weights": [{"name": "sequential/conv1d/kernel", "shape": [3, 1, 32], "dtype": "float32"}, {"name": "sequential/conv1d/bias", "shape": [32], "dtype": "float32"}, {"name": "sequential/conv1d_1/kernel", "shape": [3, 32, 64], "dtype": "float32"}, {"name": "sequential/conv1d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "sequential/conv1d_2/kernel", "shape": [3, 64, 128], "dtype": "float32"}, {"name": "sequential/conv1d_2/bias", "shape": [128], "dtype": "float32"}, {"name": "sequential/dense/kernel", "shape": [6144000, 128], "dtype": "float32"}, {"name": "sequential/dense/bias", "shape": [128], "dtype": "float32"}, {"name": "sequential/dense_1/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "sequential/dense_1/bias", "shape": [64], "dtype": "float32"}, {"name": "sequential/dense_2/kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "sequential/dense_2/bias", "shape": [32], "dtype": "float32"}, {"name": "sequential/dense_3/kernel", "shape": [32, 1], "dtype": "float32"}, {"name": "sequential/dense_3/bias", "shape": [1], "dtype": "float32"}]}]}